4_CI4-TabelMhsV2/app/Models/mahasiswamodel.php

SELECT *
FROM `mahasiswa`
WHERE `nim` = '082'
 LIMIT 1
---
    public function getMahasiswaByNim($nim)
    {
        // Menggunakan query builder yang lebih aman untuk mengambil data
        // berdasarkan nim dan mengembalikan satu baris data saja.
        return $this->where(['nim' => $nim])->first();