6_CI4-LoginLogout/app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function loginProcess()
    {
        $session = session();
        $model = new UserModel();  // ⬅️ pakai UserModel, bukan mahasiswamodel

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $model->where('username', $username)->first();